### Importing pandas

In [2]:
import pandas as pd

### Creating a test dataframe

In [5]:
data=pd.DataFrame({
    "Name":['Alice Falls','Jack Turner','George Brown','Tom Smith','Linda Newson'],
    "Scores":[82.5,60,74,91,55]
})

In [12]:
data

           Name  Scores  Adjusted_scores
0   Alice Falls    82.5             8.25
1   Jack Turner    60.0             6.00
2  George Brown    74.0             7.40
3     Tom Smith    91.0             9.10
4  Linda Newson    55.0             5.50

In [7]:
data.dtypes

Name       object
Scores    float64
dtype: object

### Creating a new column and executing a mathematical procedure (e.g., addition, subtraction, multiplication, division) in one of the existing columns using a lambda function.

#### Scores are out of 100. I am bringing the scores to 10 points using lambda function.

In [10]:
data['Adjusted_scores']=data['Scores'].apply(lambda x : (x*10)/100)

In [11]:
data

           Name  Scores  Adjusted_scores
0   Alice Falls    82.5             8.25
1   Jack Turner    60.0             6.00
2  George Brown    74.0             7.40
3     Tom Smith    91.0             9.10
4  Linda Newson    55.0             5.50

### Creating a flag column from the text column in example dataframe using a lambda function

#### I am creating a flag column for pass or fail based on the score obtained by the individual student.

In [17]:
data['Status'] = data['Scores'].apply(lambda x:'Pass' if x >60 else 'Fail')

In [18]:
data

           Name  Scores  Adjusted_scores Status
0   Alice Falls    82.5             8.25   Pass
1   Jack Turner    60.0             6.00   Fail
2  George Brown    74.0             7.40   Pass
3     Tom Smith    91.0             9.10   Pass
4  Linda Newson    55.0             5.50   Fail